espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/mt793x_sdk/filogic/middleware/third_party/lwprintf/examples/stm32/lwprintf_stm32l432kc_nucleo/Core/Startup/startup_stm32l412kbux.s
/**
  ******************************************************************************
  * @file      startup_stm32l412xx.s
  * @author    MCD Application Team
  * @brief     STM32L412xx devices vector table for GCC toolchain.
  *            This module performs:
  *                - Set the initial SP
  *                - Set the initial PC == Reset_Handler,
  *                - Set the vector table entries with the exceptions ISR address,
  *                - Configure the clock system
  *                - Branches to main in the C library (which eventually
  *                  calls main()).
  *            After Reset the Cortex-M4 processor is in Thread mode,
  *            priority is Privileged, and the Stack is set to Main.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2018 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Apache License, Version 2.0,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/Apache-2.0
  *
  ******************************************************************************
  */

.syntax unified
.cpu cortex - m4
.fpu softvfp
.thumb

.global g_pfnVectors
.global Default_Handler

/* start address for the initialization values of the .data section.
defined in linker script */
.word   _sidata
/* start address for the .data section. defined in linker script */
.word   _sdata
/* end address for the .data section. defined in linker script */
.word   _edata
/* start address for the .bss section. defined in linker script */
.word   _sbss
/* end address for the .bss section. defined in linker script */
.word   _ebss

.equ  BootRAM,        0xF1E0F85F
/**
 * @brief  This is the code that gets called when the processor first
 *          starts execution following a reset event. Only the absolutely
 *          necessary set is performed, after which the application
 *          supplied main() routine is called.
 * @param  None
 * @retval : None
*/

.section    .text.Reset_Handler
.weak   Reset_Handler
.type   Reset_Handler, % function
Reset_Handler:
ldr   sp, = _estack   /* Set stack pointer */

            /* Call the clock system initialization function.*/
            bl  SystemInit

            /* Copy the data segment initializers from flash to SRAM */
            movs  r1, #0
            b LoopCopyDataInit

            CopyDataInit:
            ldr r3, = _sidata
                      ldr r3, [r3, r1]
                      str r3, [r0, r1]
                      adds    r1, r1, #4

                      LoopCopyDataInit:
                      ldr r0, = _sdata
                                ldr r3, = _edata
                                          adds    r2, r0, r1
                                          cmp r2, r3
                                          bcc CopyDataInit
                                          ldr r2, = _sbss
                                                    b   LoopFillZerobss
                                                    /* Zero fill the bss segment. */
                                                    FillZerobss:
                                                    movs    r3, #0
                                                    str r3, [r2], #4

                                                    LoopFillZerobss:
                                                    ldr r3, = _ebss
                                                              cmp r2, r3
                                                              bcc FillZerobss

                                                              /* Call static constructors */
                                                              bl __libc_init_array
                                                              /* Call the application's entry point.*/
                                                              bl  main

                                                              LoopForever:
                                                              b LoopForever

                                                              .size   Reset_Handler, . - Reset_Handler

                                                              /**
                                                               * @brief  This is the code that gets called when the processor receives an
                                                               *         unexpected interrupt.  This simply enters an infinite loop, preserving
                                                               *         the system state for examination by a debugger.
                                                               *
                                                               * @param  None
                                                               * @retval : None
                                                              */
                                                              .section    .text.Default_Handler, "ax", % progbits
                                                              Default_Handler:
                                                              Infinite_Loop:
                                                              b   Infinite_Loop
                                                              .size   Default_Handler, . - Default_Handler
                                                              /******************************************************************************
                                                              *
                                                              * The minimal vector table for a Cortex-M4.  Note that the proper constructs
                                                              * must be placed on this to ensure that it ends up at physical address
                                                              * 0x0000.0000.
                                                              *
                                                              ******************************************************************************/
                                                              .section    .isr_vector, "a", % progbits
                                                              .type   g_pfnVectors, % object
                                                              .size   g_pfnVectors, . - g_pfnVectors


                                                              g_pfnVectors:
                                                              .word   _estack
                                                              .word   Reset_Handler
                                                              .word   NMI_Handler
                                                              .word   HardFault_Handler
                                                              .word   MemManage_Handler
                                                              .word   BusFault_Handler
                                                              .word   UsageFault_Handler
                                                              .word   0
                                                              .word   0
                                                              .word   0
                                                              .word   0
                                                              .word   SVC_Handler
                                                              .word   DebugMon_Handler
                                                              .word   0
                                                              .word   PendSV_Handler
                                                              .word   SysTick_Handler
                                                              .word   WWDG_IRQHandler
                                                              .word   PVD_PVM_IRQHandler
                                                              .word   TAMP_STAMP_IRQHandler
                                                              .word   RTC_WKUP_IRQHandler
                                                              .word   FLASH_IRQHandler
                                                              .word   RCC_IRQHandler
                                                              .word   EXTI0_IRQHandler
                                                              .word   EXTI1_IRQHandler
                                                              .word   EXTI2_IRQHandler
                                                              .word   EXTI3_IRQHandler
                                                              .word   EXTI4_IRQHandler
                                                              .word   DMA1_Channel1_IRQHandler
                                                              .word   DMA1_Channel2_IRQHandler
                                                              .word   DMA1_Channel3_IRQHandler
                                                              .word   DMA1_Channel4_IRQHandler
                                                              .word   DMA1_Channel5_IRQHandler
                                                              .word   DMA1_Channel6_IRQHandler
                                                              .word   DMA1_Channel7_IRQHandler
                                                              .word   ADC1_2_IRQHandler
                                                              .word   0
                                                              .word   0
                                                              .word   0
                                                              .word   0
                                                              .word   EXTI9_5_IRQHandler
                                                              .word   TIM1_BRK_TIM15_IRQHandler
                                                              .word   TIM1_UP_TIM16_IRQHandler
                                                              .word   TIM1_TRG_COM_IRQHandler
                                                              .word   TIM1_CC_IRQHandler
                                                              .word   TIM2_IRQHandler
                                                              .word   0
                                                              .word   0
                                                              .word   I2C1_EV_IRQHandler
                                                              .word   I2C1_ER_IRQHandler
                                                              .word   I2C2_EV_IRQHandler
                                                              .word   I2C2_ER_IRQHandler
                                                              .word   SPI1_IRQHandler
                                                              .word   SPI2_IRQHandler
                                                              .word   USART1_IRQHandler
                                                              .word   USART2_IRQHandler
                                                              .word   USART3_IRQHandler
                                                              .word   EXTI15_10_IRQHandler
                                                              .word   RTC_Alarm_IRQHandler
                                                              .word   0
                                                              .word   0
                                                              .word   0
                                                              .word   0
                                                              .word   0
                                                              .word   0
                                                              .word   0
                                                              .word   0
                                                              .word   0
                                                              .word   0
                                                              .word   0
                                                              .word   0
                                                              .word   TIM6_IRQHandler
                                                              .word   0
                                                              .word   DMA2_Channel1_IRQHandler
                                                              .word   DMA2_Channel2_IRQHandler
                                                              .word   DMA2_Channel3_IRQHandler
                                                              .word   DMA2_Channel4_IRQHandler
                                                              .word   DMA2_Channel5_IRQHandler
                                                              .word   0
                                                              .word   0
                                                              .word   0
                                                              .word   COMP_IRQHandler
                                                              .word   LPTIM1_IRQHandler
                                                              .word   LPTIM2_IRQHandler
                                                              .word   USB_IRQHandler
                                                              .word   DMA2_Channel6_IRQHandler
                                                              .word   DMA2_Channel7_IRQHandler
                                                              .word   LPUART1_IRQHandler
                                                              .word   QUADSPI_IRQHandler
                                                              .word   I2C3_EV_IRQHandler
                                                              .word   I2C3_ER_IRQHandler
                                                              .word   0
                                                              .word   0
                                                              .word   0
                                                              .word   TSC_IRQHandler
                                                              .word   0
                                                              .word   0
                                                              .word   RNG_IRQHandler
                                                              .word   FPU_IRQHandler
                                                              .word   CRS_IRQHandler


