espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/mt793x_sdk/filogic/middleware/third_party/lwprintf/examples/stm32/lwprintf_stm32l432kc_nucleo/Core/Startup/startup_stm32l412kbux.s
                                                              /*******************************************************************************
                                                              *
                                                              * Provide weak aliases for each Exception handler to the Default_Handler.
                                                              * As they are weak aliases, any function with the same name will override
                                                              * this definition.
                                                              *
                                                              *******************************************************************************/

                                                              .weak NMI_Handler
                                                              .thumb_set NMI_Handler, Default_Handler

                                                              .weak HardFault_Handler
                                                              .thumb_set HardFault_Handler, Default_Handler

                                                              .weak MemManage_Handler
                                                              .thumb_set MemManage_Handler, Default_Handler

                                                              .weak BusFault_Handler
                                                              .thumb_set BusFault_Handler, Default_Handler

                                                              .weak   UsageFault_Handler
                                                              .thumb_set UsageFault_Handler, Default_Handler

                                                              .weak   SVC_Handler
                                                              .thumb_set SVC_Handler, Default_Handler

                                                              .weak   DebugMon_Handler
                                                              .thumb_set DebugMon_Handler, Default_Handler

                                                              .weak   PendSV_Handler
                                                              .thumb_set PendSV_Handler, Default_Handler

                                                              .weak   SysTick_Handler
                                                              .thumb_set SysTick_Handler, Default_Handler

                                                              .weak   WWDG_IRQHandler
                                                              .thumb_set WWDG_IRQHandler, Default_Handler

                                                              .weak   PVD_PVM_IRQHandler
                                                              .thumb_set PVD_PVM_IRQHandler, Default_Handler

                                                              .weak   TAMP_STAMP_IRQHandler
                                                              .thumb_set TAMP_STAMP_IRQHandler, Default_Handler

                                                              .weak   RTC_WKUP_IRQHandler
                                                              .thumb_set RTC_WKUP_IRQHandler, Default_Handler

                                                              .weak   FLASH_IRQHandler
                                                              .thumb_set FLASH_IRQHandler, Default_Handler

                                                              .weak   RCC_IRQHandler
                                                              .thumb_set RCC_IRQHandler, Default_Handler

                                                              .weak   EXTI0_IRQHandler
                                                              .thumb_set EXTI0_IRQHandler, Default_Handler

                                                              .weak   EXTI1_IRQHandler
                                                              .thumb_set EXTI1_IRQHandler, Default_Handler

                                                              .weak   EXTI2_IRQHandler
                                                              .thumb_set EXTI2_IRQHandler, Default_Handler

                                                              .weak   EXTI3_IRQHandler
                                                              .thumb_set EXTI3_IRQHandler, Default_Handler

                                                              .weak   EXTI4_IRQHandler
                                                              .thumb_set EXTI4_IRQHandler, Default_Handler

                                                              .weak   DMA1_Channel1_IRQHandler
                                                              .thumb_set DMA1_Channel1_IRQHandler, Default_Handler

                                                              .weak   DMA1_Channel2_IRQHandler
                                                              .thumb_set DMA1_Channel2_IRQHandler, Default_Handler

                                                              .weak   DMA1_Channel3_IRQHandler
                                                              .thumb_set DMA1_Channel3_IRQHandler, Default_Handler

                                                              .weak   DMA1_Channel4_IRQHandler
                                                              .thumb_set DMA1_Channel4_IRQHandler, Default_Handler

                                                              .weak   DMA1_Channel5_IRQHandler
                                                              .thumb_set DMA1_Channel5_IRQHandler, Default_Handler

                                                              .weak   DMA1_Channel6_IRQHandler
                                                              .thumb_set DMA1_Channel6_IRQHandler, Default_Handler

                                                              .weak   DMA1_Channel7_IRQHandler
                                                              .thumb_set DMA1_Channel7_IRQHandler, Default_Handler

                                                              .weak   ADC1_2_IRQHandler
                                                              .thumb_set ADC1_2_IRQHandler, Default_Handler

                                                              .weak   EXTI9_5_IRQHandler
                                                              .thumb_set EXTI9_5_IRQHandler, Default_Handler

                                                              .weak   TIM1_BRK_TIM15_IRQHandler
                                                              .thumb_set TIM1_BRK_TIM15_IRQHandler, Default_Handler

                                                              .weak   TIM1_UP_TIM16_IRQHandler
                                                              .thumb_set TIM1_UP_TIM16_IRQHandler, Default_Handler

                                                              .weak   TIM1_TRG_COM_IRQHandler
                                                              .thumb_set TIM1_TRG_COM_IRQHandler, Default_Handler

                                                              .weak   TIM1_CC_IRQHandler
                                                              .thumb_set TIM1_CC_IRQHandler, Default_Handler

