espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/mt793x_sdk/filogic/middleware/third_party/lwprintf/examples/stm32/lwprintf_stm32l432kc_nucleo/Core/Startup/startup_stm32l412kbux.s
                                                              .weak   TIM2_IRQHandler
                                                              .thumb_set TIM2_IRQHandler, Default_Handler

                                                              .weak   I2C1_EV_IRQHandler
                                                              .thumb_set I2C1_EV_IRQHandler, Default_Handler

                                                              .weak   I2C1_ER_IRQHandler
                                                              .thumb_set I2C1_ER_IRQHandler, Default_Handler

                                                              .weak   I2C2_EV_IRQHandler
                                                              .thumb_set I2C2_EV_IRQHandler, Default_Handler

                                                              .weak   I2C2_ER_IRQHandler
                                                              .thumb_set I2C2_ER_IRQHandler, Default_Handler

                                                              .weak   SPI1_IRQHandler
                                                              .thumb_set SPI1_IRQHandler, Default_Handler

                                                              .weak   SPI2_IRQHandler
                                                              .thumb_set SPI2_IRQHandler, Default_Handler

                                                              .weak   USART1_IRQHandler
                                                              .thumb_set USART1_IRQHandler, Default_Handler

                                                              .weak   USART2_IRQHandler
                                                              .thumb_set USART2_IRQHandler, Default_Handler

                                                              .weak   USART3_IRQHandler
                                                              .thumb_set USART3_IRQHandler, Default_Handler

                                                              .weak   EXTI15_10_IRQHandler
                                                              .thumb_set EXTI15_10_IRQHandler, Default_Handler

                                                              .weak   RTC_Alarm_IRQHandler
                                                              .thumb_set RTC_Alarm_IRQHandler, Default_Handler

                                                              .weak   TIM6_IRQHandler
                                                              .thumb_set TIM6_IRQHandler, Default_Handler

                                                              .weak   DMA2_Channel1_IRQHandler
                                                              .thumb_set DMA2_Channel1_IRQHandler, Default_Handler

                                                              .weak   DMA2_Channel2_IRQHandler
                                                              .thumb_set DMA2_Channel2_IRQHandler, Default_Handler

                                                              .weak   DMA2_Channel3_IRQHandler
                                                              .thumb_set DMA2_Channel3_IRQHandler, Default_Handler

                                                              .weak   DMA2_Channel4_IRQHandler
                                                              .thumb_set DMA2_Channel4_IRQHandler, Default_Handler

                                                              .weak   DMA2_Channel5_IRQHandler
                                                              .thumb_set DMA2_Channel5_IRQHandler, Default_Handler

                                                              .weak   COMP_IRQHandler
                                                              .thumb_set COMP_IRQHandler, Default_Handler

                                                              .weak   LPTIM1_IRQHandler
                                                              .thumb_set LPTIM1_IRQHandler, Default_Handler

                                                              .weak   LPTIM2_IRQHandler
                                                              .thumb_set LPTIM2_IRQHandler, Default_Handler

                                                              .weak   USB_IRQHandler
                                                              .thumb_set USB_IRQHandler, Default_Handler

                                                              .weak   DMA2_Channel6_IRQHandler
                                                              .thumb_set DMA2_Channel6_IRQHandler, Default_Handler

                                                              .weak   DMA2_Channel7_IRQHandler
                                                              .thumb_set DMA2_Channel7_IRQHandler, Default_Handler

                                                              .weak   LPUART1_IRQHandler
                                                              .thumb_set LPUART1_IRQHandler, Default_Handler

                                                              .weak   QUADSPI_IRQHandler
                                                              .thumb_set QUADSPI_IRQHandler, Default_Handler

                                                              .weak   I2C3_EV_IRQHandler
                                                              .thumb_set I2C3_EV_IRQHandler, Default_Handler

                                                              .weak   I2C3_ER_IRQHandler
                                                              .thumb_set I2C3_ER_IRQHandler, Default_Handler

                                                              .weak   TSC_IRQHandler
                                                              .thumb_set TSC_IRQHandler, Default_Handler

                                                              .weak   RNG_IRQHandler
                                                              .thumb_set RNG_IRQHandler, Default_Handler

                                                              .weak   FPU_IRQHandler
                                                              .thumb_set FPU_IRQHandler, Default_Handler

                                                              .weak   CRS_IRQHandler
                                                              .thumb_set CRS_IRQHandler, Default_Handler
                                                              /************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
